app/controllers/users_controller.rb

INSERT INTO `users` (`last_login_at`, `last_request_at`, `updated_at`, `crypted_password`, `single_access_token`, `perishable_token`, `current_login_ip`, `is_admin`, `password_salt`, `current_login_at`, `failed_login_count`, `uuid`, `persistence_token`, `login_count`, `first_name`, `login`, `last_name`, `email`, `last_login_ip`, `created_at`) VALUES(NULL, '2009-04-26 15:13:00', '2009-04-26 15:13:00', '7c6cc4f19ee8f3618de80f7313e7d9f9ad16977519b4e8e1d651623e2d1640dbc5bbeb5f4f01559155e1b1b07dd6c4b9969d0826d84b53c5db767377524e4b31', 'OnbIs-NI0k0ZlFMf_1AT', '6j7K1RacEASc5f0yjOsT', '10.0.0.69', 0, 'fcHXcBC-E28sNvpwEuAz', '2009-04-26 15:13:00', 0, 'baf5281e-3274-11de-bc60-001ff34ec87b', 'bbd40e0a48b1c6d7ef2470856fdef4f51390ac066145c67f1f7bad1e883b7fb6897861313405e07eb7d12868b73f31680e019b0796ff9c9e8be22d4e5476ffa3', 1, 'Hans', 'hmasing', 'Masing', 'hans@masing.net', NULL, '2009-04-26 15:13:00')
---
  def create
    @user = User.new(params[:user])
    if @user.save